## Applied Machine Learning
### Assignment-I
### Introductory Data Analysis Assignment

Date of Submission: 20th January 2025

    Submitted to:                           Submitted by:
    Dr. Shresth Gupta                       Amulya Jain
                                            B. Tech CSE AIML Batch 1
                                            500122439

#### Understanding the Data and Dataset:

##### What is Real Estate ?

Real estate refers to land and any permanent structures attached to it, such as buildings, houses, or other improvements. It plays a crucial role in the economy, as it involves property ownership, investment and development.

##### Factors which Affect Real Estate Price (Y): 
- X1: Transaction Date
- X2: House Age
- X3: Distance to the Nearest MRT Station
- X4: Number of Convenience Stores
- X5 & X6: Latitude and Longitude

where Y: House Price of Unit Area

### Assignment Questions

#### Importing Libraries

In [37]:
import pandas as pd 
import numpy as np

###  1. Dataset Overview:

####  Load the dataset

In [85]:
path = "Real estate.csv"
df = pd.read_csv(path)

####  Display the first five rows

In [86]:
df.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

#### Identify the column names and data types

In [87]:
df.ndim

2

In [88]:
df.shape

(414, 8)

In [89]:
df.size

3312

In [90]:
df.columns

Index(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude',
       'Y house price of unit area'],
      dtype='object')

In [91]:
df.dtypes

No                                          int64
X1 transaction date                       float64
X2 house age                              float64
X3 distance to the nearest MRT station    float64
X4 number of convenience stores             int64
X5 latitude                               float64
X6 longitude                              float64
Y house price of unit area                float64
dtype: object

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414 entries, 0 to 413
Data columns (total 8 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   No                                      414 non-null    int64
 1   X1 transaction date                     414 non-null    float64
 2   X2 house age                            414 non-null    float64
 3   X3 distance to the nearest MRT station  414 non-null    float64
 4   X4 number of convenience stores         414 non-null    int64
 5   X5 latitude                             414 non-null    float64
 6   X6 longitude                            414 non-null    float64
 7   Y house price of unit area              414 non-null    float64
dtypes: float64(6), int64(2)
memory usage: 26.0 KB

In [93]:
df.isna()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
409,False,False,False,False,False,False,False,False
410,False,False,False,False,False,False,False,False
411,False,False,False,False,False,False,False,False
412,False,False,False,False,False,False,False,False
413,False,False,False,False,False,False,False,False

In [94]:
df.isna().sum()

No                                        0
X1 transaction date                       0
X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64

#### Dataset Observations:
1. No missing data in any column or row.
2. Upon observing the general information of all the columns:
    - Column "X1 transaction date" is inconsistent due to: 
        - Data Type: float64
        - Preferred Data Type: Datetime data type

In [95]:
# Function to convert fractional year to datetime
def fractional_year_to_date(fractional_year):
    year = int(fractional_year)  # Extract the year
    remainder = fractional_year - year  # Get the fractional part
    days_in_year = 366 if (year % 4 == 0 and (year % 100 != 0 or year % 400 == 0)) else 365  # Leap year check
    days = int(remainder * days_in_year)  # Convert fraction to days
    date = pd.Timestamp(year=year, month=1, day=1) + pd.Timedelta(days=days)  # Add days to Jan 1
    return date

# Apply conversion
df['X1 transaction date'] = df['X1 transaction date'].apply(fractional_year_to_date)
df.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012-12-01,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012-12-01,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013-08-01,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013-07-02,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012-10-31,5.0,390.56840,5,24.97937,121.54245,43.1

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414 entries, 0 to 413
Data columns (total 8 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   No                                      414 non-null    int64
 1   X1 transaction date                     414 non-null    datetime64[ns]
 2   X2 house age                            414 non-null    float64
 3   X3 distance to the nearest MRT station  414 non-null    float64
 4   X4 number of convenience stores         414 non-null    int64
 5   X5 latitude                             414 non-null    float64
 6   X6 longitude                            414 non-null    float64
 7   Y house price of unit area              414 non-null    float64
dtypes: datetime64[ns](1), float64(5), int64(2)
memory usage: 26.0 KB

#### Dataset Observations:
1. Total Null values in all columns is 0.
2. Column "X1 transaction date" is consistent with datetime64[ns] Data Type, useful data format for further analysis.

### 2. Statistical Summary:

#### Generate a statistical summary (mean, median, standard deviation, minimum, and maximum) for all numerical columns.

In [98]:
summary = df.describe()
summary

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
count,414.000000,414,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000
mean,207.500000,2013-02-23 20:55:39.130434816,17.712560,1083.885689,4.094203,24.969030,121.533361,37.980193
min,1.000000,2012-09-01 00:00:00,0.000000,23.382840,0.000000,24.932070,121.473530,7.600000
25%,104.250000,2012-12-01 00:00:00,9.025000,289.324800,1.000000,24.963000,121.528085,27.700000
50%,207.500000,2013-03-02 00:00:00,16.100000,492.231300,4.000000,24.971100,121.538630,38.450000
75%,310.750000,2013-06-02 00:00:00,28.150000,1454.279000,6.000000,24.977455,121.543305,46.600000
max,414.000000,2013-08-01 00:00:00,43.800000,6488.021000,10.000000,25.014590,121.566270,117.500000
std,119.655756,NaN,11.392485,1262.109595,2.945562,0.012410,0.015347,13.606488

#### What does this summary tell you about the distribution of house prices and other features?